import { CountriesList } from "../apiTypes";

export const mockCountriesList: CountriesList = [
  {
    id: "6043d483656ac305b15f314c",
    name: "Польша",
    capital: "Варшава",
    location: {
      lat: "51.9194",
      long: "19.1451",
    },
    timezone: "Warsaw/Poland",
    alpha3Code: "POL",
    currencyCode: "PLN",
    video: "https://www.youtube.com/watch?v=ekz6i58kVpI&t=221s",
    image: {
      alt: "Варшава, Польша",
      thumbnail:
        "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Lotnicza_panorama_Warszawy.jpg/320px-Lotnicza_panorama_Warszawy.jpg",
      mainImage:
        "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Lotnicza_panorama_Warszawy.jpg/1280px-Lotnicza_panorama_Warszawy.jpg",
    },
    galleryImages: [
      {
        thumbnail:
          "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Krakow_Rynek_Glowny_panorama_2.jpg/320px-Krakow_Rynek_Glowny_panorama_2.jpg",
        mainImage:
          "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Krakow_Rynek_Glowny_panorama_2.jpg/1280px-Krakow_Rynek_Glowny_panorama_2.jpg",
        alt: "Краков, Польша",
        description:
          "Краков - полное официальное название — Столичный королевский город Краков (польск. Stołeczne Królewskie Miasto Kraków, лат. Cracovia, нем. Krakau) — город на юге Польши, расположенный на реке Висле в 295 км от Варшавы. Население насчитывает 779 115 жителей (2019), вместе с ближайшими пригородами — свыше 1 млн, является вторым по населению (ненамного опережает Лодзь) и площади городом Польши после Варшавы. Административный центр Малопольского воеводства, центр архиепархии. Столица Польши с 1038 по 1596 год, до 1734 года — место коронации польских королей. Богат историческими памятниками, центр города занесён в Список объектов всемирного наследия ЮНЕСКО. Один из крупнейших научных, культурных, экономических и религиозных центров Польши, популярное место туризма. Культурная столица Европы в 2000 году.",
      },
      {
        thumbnail:
          "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Plac_Zamkowy_w_Warszawie_widziany_z_wie%C5%BCy_ko%C5%9Bcio%C5%82a_%C5%9Bw._Anny.JPG/320px-Plac_Zamkowy_w_Warszawie_widziany_z_wie%C5%BCy_ko%C5%9Bcio%C5%82a_%C5%9Bw._Anny.JPG",
        mainImage:
          "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Plac_Zamkowy_w_Warszawie_widziany_z_wie%C5%BCy_ko%C5%9Bcio%C5%82a_%C5%9Bw._Anny.JPG/1280px-Plac_Zamkowy_w_Warszawie_widziany_z_wie%C5%BCy_ko%C5%9Bcio%C5%82a_%C5%9Bw._Anny.JPG",
        alt: "Варшава, Польша",
        description:
          "Варша́ва — столица и крупнейший по населению и по территории город Польши. Город стал фактической столицей в 1596 году, когда после пожара в Вавельском замке в Кракове король Сигизмунд III перенёс свою резиденцию сюда, при этом столичный статус города был подтверждён только в Конституции 1791 года. Через город протекает река Висла, разделяющая город приблизительно поровну. В наше время Варшава — это смесь разнообразных архитектурных стилей, во многом благодаря насыщенной истории как Польши, так и самой столицы. Во время войны старый город был практически полностью уничтожен и восстановлен лишь в послевоенные годы. Например, королевский дворец (историческое сердце Варшавы) был отстроен только в 1970-е и 1980-е годы, причём отдельные реставрационные работы идут до сих пор. Исторический центр Варшавы включён в список Всемирного наследия как примерный образец доскональной реставрации уничтоженного исторического наследия. Времена ПНР оставили после себя здания в стиле сталинского ампира. Несколько значимых исторических памятников были воссозданы уже после падения режима ПНР. В последние десятилетия панорама города обогатилась современными небоскрёбами и бизнес-центрами. Религиозные здания города включают множество католических и несколько протестантских храмов, а также Троицкую церковь, являющуюся центром коптского христианства в Польше.",
      },
      {
        thumbnail:
          "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Wroclaw_-_Ostrow_Tumski.jpg/320px-Wroclaw_-_Ostrow_Tumski.jpg",
        mainImage:
          "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Wroclaw_-_Ostrow_Tumski.jpg/1280px-Wroclaw_-_Ostrow_Tumski.jpg",
        alt: "Вроцлав, Польша",
        description:
          "Вро́цлав — столица Силезии, город на правах повета, один из самых крупных (четвёртый по населению в Польше после Варшавы, Кракова и Лодзи) и самых старых городов Польши, расположенный на обоих берегах среднего течения Одры, на Силезской низменности. Религиозные здания города включают множество католических и несколько протестантских храмов, а также Троицкую церковь, являющуюся центром коптского христианства в Польше. Через город протекает пять рек: Одра и четыре её притока. До Второй мировой войны в городе было триста три моста, сейчас их насчитывается около ста тридцати. В настоящее время Вроцлав является столицей Нижнесилезского воеводства и центром Вроцлавского повята, также включающего в себя девять гмин: Черница, Длуголенка, Йорданув-Слёнски, Конты-Вроцлавске, Кобежице, Меткув, Собутка, Сехнице, Журавина. До 1990 года Вроцлав был разделен на пять исторических районов: Пше-Поле, Средместье, Старый Город, Кшики, Фабрична. В настоящее время в его состав входит 48 муниципальных образований.",
      },
    ],
    description:
      "По́льша, официальное название — Респу́блика По́льша — государство в Центральной Европе. Население по итогам 2015 года составляет 38 623 221 человек, территория — 312 679 км². Занимает 37-е место в мире по численности населения и 69-е по территории. Столица — Варшава. Государственный язык — польский. Унитарное государство, парламентская республика. Президент — Анджей Дуда. Премьер-министр — Матеуш Моравецкий. Подразделяется на 16 воеводств. Расположена в центре Европы. Омывается на севере Балтийским морем. Имеет сухопутную границу с Россией (Калининградской областью), Литвой, Белоруссией, Украиной, Словакией, Чехией и Германией. Бо́льшая часть верующих (около 87 % населения) исповедует католицизм, что делает Польшу страной с самым большим католическим населением в Центральной Европе. Индустриальная страна с развитой экономикой. Объём ВВП по паритету покупательной способности (ППС) на душу населения — 31 430 долларов в год (2018). В 2018 году ВВП Польши по ППС составил 1193 млрд долл.. Денежная единица — польский злотый (усреднённый курс за 2016 год — 3,8 злотого за 1 доллар США).",
  },
];
